#encoding "utf-8"    // сообщаем парсеру о том, в какой кодировке написана грамматика
#GRAMMAR_ROOT ROOT     // указываем корневой нетерминал грамматики

//ADV -> AnyWord<gram="ADV">;
//ADVPRO -> AnyWord<gram="ADVPRO">;
ANUM -> AnyWord<gram="ANUM">;
APRO -> AnyWord<gram="APRO">;

CONJ -> AnyWord<gram="CONJ">;
INTJ ->  AnyWord<gram="INTJ">;
NUM -> AnyWord<gram="NUM">;
//PART -> AnyWord<gram="PART">;
PR -> AnyWord<gram="PR">;
SPRO ->  AnyWord<gram="SPRO">;
//V ->  AnyWord<gram="V">;
EXACTWORDS -> "задача" | "нападающий" | "фото" | "источник" | "курс" | "глава" | "видео" | "вход" | "выход" |"и"|"в"|"не"|"на"|"что"|"я"|"с"|"он"|"а"|"как"|"но"|"его"|"к"|"это"|"все"|"по"|"из"|"у"|"она"|"за"|"от"|"так"|"же"|"о"|"ты"|"они"|"было"|"мы"|"бы"|"ее"|"вы"|"для"|"мне"|"если"|"то"|"еще"|"меня"|"был"|"только"|"когда"|"их"|"или"|"чтобы"|"сказал"|"до"|"уже"|"ему"|"да"|"нет"|"может"|"ни"|"даже"|"чем"|"него"|"быть"|"были"|"была"|"вот"|"время"|"себя"|"ли"|"под"|"во"|"со"|"очень"|"есть"|"где"|"теперь"|"там"|"при"|"этого"|"того"|"будет"|"здесь"|"нас"|"раз"|"этот"|"ничего"|"потом"|"этом"|"можно"|"кто"|"через"|"вас"|"них"|"тебя"|"один"|"без"|"после"|"себе"|"ну"|"п"|"вам"|"тебе"|"больше"|"тут"|"сейчас"|"человек"|"который"|"том"|"ним"|"более"|"которые"|"им"|"тогда"|"несколько"|"глаза"|"нам"|"пока"|"тем"|"т"|"просто"|"над"|"тоже"|"всех"|"перед"|"надо"|"потому"|"тот"|"мог"|"об"|"ей"|"лишь"|"ведь"|"г"|"снова"|"эти"|"сам"|"всего"|"хотя"|"что-то"|"спросил"|"ней"|"почему"|"нее"|"конечно"|"своей"|"этой"|"дело"|"м"|"между"|"лет"|"хорошо"|"свою"|"почти"|"люди"|"никогда"|"два"|"руки"|"такой"|"жизни"|"затем"|"всегда"|"знаю"|"людей"|"мой"|"много"|"сказала"|"н"|"времени"|"вдруг"|"однако"|"должен"|"словно"|"совсем"|"лицо"|"ответил"|"нужно"|"человека"|"чего"|"стал"|"своего"|"лучше"|"д"|"свои"|"жизнь"|"голову"|"собой"|"своих"|"слишком"|"именно"|"сказать"|"сразу"|"уж"|"руку"|"другой"|"эта"|"всем"|"оно"|"наконец"|"голос"|"три"|"свой"|"быстро"|"никто"|"назад"|"эту"|"знал"|"тех"|"будто"|"такое"|"могу"|"вместе"|"друг"|"дверь"|"ж"|"слова"|"также"|"которой"|"свое"|"которая"|"значит"|"место"|"л"|"рядом"|"этим"|"этих"|"куда"|"совершенно"|"нем"|"видел"|"кроме"|"случае"|"тому"|"сделать"|"е"|"которых"|"б"|"понял"|"поэтому"|"хотел"|"своим"|"те"|"вокруг"|"сторону"|"которого"|"делать"|"одного"|"головой"|"должны"|"увидел"|"одной"|"прямо"|"могут"|"дома"|"немного"|"таким"|"опять"|"одна"|"каждый"|"стороны"|"ко"|"говорит"|"ними"|"весь"|"мной"|"подумал"|"кажется"|"казалось"|"говорил"|"возможно"|"из-за"|"сегодня"|"ноги"|"нему"|"образом"|"среди"|"самом"|"других"|"всю"|"прежде"|"вперед"|"вообще"|"хоть"|"начал"|"действительно"|"одно"|"дальше"|"нельзя"|"сколько"|"пусть"|"правда"|"две"|"чуть"|"против"|"мир"|"сюда"|"моя"|"года"|"могли"|"хочу"|"заметил"|"стало"|"такие"|"долго"|"которую"|"другие"|"медленно"|"тело";

ROOT ->  APRO |  CONJ | INTJ | NUM | PR | SPRO  |EXACTWORDS ;//| PART;